first = ['Strings', 'Student', 'Computers']
second = ['Строка', 'Урбан', 'Компьютер']

#  Используется генераторная сборка, которая перебирает строки из двух списков с помощью функции zip.
#  Для каждой пары строк проверяется, равны ли их длины. Если длины не равны, вычисляется абсолютная разница и добавляется в результат.
first_result = (abs(len(f) - len(s)) for f, s in zip(first, second) if len(f) != len(s))

# Используется генераторная сборка с range и len, которая сравнивает длины строк в одинаковых позициях из обоих списков.
# Для каждой позиции возвращается True, если длины строк не равны, и False в противном случае.
second_result = (len(first[i]) != len(second[i]) for i in range(len(first)))

# Примеры вывода
print(list(first_result))
print(list(second_result))