# Входные данные
team1_num = 6
team2_num = 6
score1 = 40
score2 = 42
team1_time = 1552.512
team2_time = 2153.31451
tasks_total = 82
time_avg = 45.2

# Определяем результат соревнования
if score1 > score2 or score1 == score2 and team1_time < team2_time:
    result = 'Победа команды Мастера кода!'
elif score1 < score2 or score1 == score2 and team1_time > team2_time:
    result = 'Победа команды Волшебники данных!'
else:
    result = 'Ничья!'
challenge_result = result

# Использование %d для форматирования строк
# 1. Количество участников первой команды
print("В команде Мастера кода участников: %d !" % team1_num)

# 2. Количество участников в обеих командах
print("Итого сегодня в командах участников: %d и %d !" % (team1_num, team2_num))

# Использование метода format() для вставки значений в строки
# 3. Количество задач, решённых командой 2
print("Команда Волшебники данных решила задач: {} !".format(score2))

# 4. Время, за которое команда 2 решила задачи
print("Волшебники данных решили задачи за {:.1f} с !".format(team2_time))

# Использование f-строк для более удобного и читаемого форматирования
# 5. Количество решённых задач по командам
print(f"Команды решили {score1} и {score2} задач.")

# 6. Исход соревнования
print(f"Результат битвы: {challenge_result}")

# 7. Количество задач и среднее время решения
print(f"Сегодня было решено {tasks_total} задач, в среднем по {time_avg} секунды на задачу!")